{
	"index": [
		{
			"name": "Qui suis-je",
			"list": [
				{
					"text": "Actuellement en 2<sup>ème</sup> année de BUT informatique, je m'intéresse principalement au développement web et le développement d'applications. J'essaye d'apprendre et de m'améliorer en permanence pour donner un travail de mieux en mieux."
				},
				{
					"text": "Je m'intéresse aussi aux environnements Linux et aux divers outils liés. Mais aussi au domaine des bases de données que je trouve intéressant."
				}
			]
		},
		{
			"name": "Hobbies",
			"list": [
				{
					"text": "J'apprécie la série Doctor Who, je pourrais en parler pendant bien trop longtemps. Mais en résumé, c'est une super série avec plus de 60ans d'histoire et d'évolution donnant un résultat superbe."
				},
				{
					"text": "J'apprécie aussi beaucoup les jeux vidéos, même si je préfère les jeux calmes sans compétition."
				},
				{
					"text": "Le développement est aussi une passion, plus particulièrement le développement web et d'application."
				}
			]
		}
	],
	"projects": [
		{
			"name": "Projets personnels",
			"list": [
				{
					"title":"Projet de scrabble duplicate web monopage",
					"start":"2023",
					"end":"now",
					"description":"Ce projet est motivé par ma mère qui aimerait pouvoir jouer au scrabble duplicate avec ses élèves lors de remplacement quand le contexte s'y prête. Hébergeant mon projet sur GitHub pages, je n'ai donc pas accès au PHP pour passer les informations entre des pages ou même pour effectuer les calculs du jeu. J'ai donc dû créer ce site en une seule page HTML accompagnée de JavaScript pour tous les calculs et les différentes scènes du site. Ce projet est donc un défi pour moi, apprenant tout juste le JavaScript. Je me heurte donc à des difficultés sur lesquelles je peux passer plusieurs jours pour les régler dû à mon manque de connaissances en JavaScript.",
					"role":"Ce projet me permet d'améliorer mes compétences en JavaScript, mais il me permet aussi de travailler sur un projet ne venant pas de moi ou de ma formation.",
					"bilan":"",
					"links":[
						{
							"content":"Jouer au scrabble",
							"target":"./404/404.html"
						}
					]
				}
			]
		},
		{
			"name": "BUT semestre 1",
			"list": [
				{
					"title":"Projet de classification automatique de dépêches en Java",
					"start":"2023",
					"end":"2023",
					"description":"Ce projet consistait, en binômes, de créer un programme Java permettant de trier de courtes dépêches selon certaines catégories. Pour cela, nous avons dû créer des listes de mots correspondant à chaque catégorie et assigner un score (poids) à chaque mot dans la catégorie en fonction de son appartenance et à sa précision sur le sujet. Par exemple, dans la catégorie science, le mot 'atome' aurait eu un poids fort contrairement au mot 'je'. Nous devions le faire premièrement à la main, puis nous devions automatiser le processus de tri des dépêches et d'ajustement des valeurs pour avoir un taux de réussite le plus haut possible.",
					"role":"Étant en binômes, et le projet n'étant qu'un projet en CLI (Command Line Interface), nous avons souvent travaillé sur les mêmes choses en améliorant ce que l'autre avait fait.",
					"bilan":"",
					"links":[]
				},
				{
					"title":"Installation d'un poste de travail sous Linux",
					"start":"2022",
					"end":"2022",
					"description":"Durant ce court projet, nous devions simplement installer Debian sur une machine virtuelle ainsi que tous les outils nécessaires pour développer en Java. Ce projet était ma première installation d'un poste de travail sous Linux tout en faisant une carte mentale récapitulant le processus d'installation pour quelqu'un qui ne s'y connait pas. Mais ce n'est pas ma dernière (bien au contraire).",
					"role":"",
					"bilan":"",
					"links":[]
				},
				{
					"title":"Création d'une base de données PostgreSQL",
					"start":"2022",
					"end":"2022",
					"description":"Nous devions, en binômes, modéliser et créer une base de données PostgreSQL sur le thème du naufrage du Titanic. Nous devions, pour modéliser la base de données, utiliser des outils comme l'UML et le format Schema Entity Association pour la représenter. Malheureusement, cette étape n'a pas pu directement être implémentée dans la base de donnée dû aux nombreuses solutions différentes. Finalement, nous devions interroger les données fournies pour répondre à des questions sur les naufragés du Titanic.",
					"role":"",
					"bilan":"",
					"links":[]
				},
				{
					"title":"Analyse et création d'un site de présentation d'une entreprise",
					"start":"2022",
					"end":"2023",
					"description":"Ce projet était composé de deux parties : l'analyse de l'entreprise et le développement d'un site statique présentant cette entreprise, comme par exemple son domaine d'activité, ses clients, son impact environnemental.",
					"role":"Durant la première partie du projet, nous fûmes tous des recherches. Puis, durant la seconde partie du projet, je m'occupais principalement de la mise en forme des informations, de la cohérence des pages et de la vérification de la conformité du code.",
					"bilan":"Ce projet était intéressant, car il m'a permis de faire du développement web en large groupe, mais aussi d'en apprendre plus sur l'entreprise que nous avions choisie.",
					"links":[]
				}
			]
		},
		{
			"name": "BUT semestre 2",
			"list": [
				{
					"title":"Création d'une application lourde de gestion d'événements en JavFX",
					"start":"2023",
					"end":"2023",
					"description":"Ce projet avait pour objectif de créer une application de bureau permettant la gestion d'un type d'évènement. L'évènement choisi par notre groupe était les tournois e-sports.",
					"role":"Durant ce projet, j'étais principalement chargé des interfaces et de la création des formulaires.",
					"bilan":"Étant un grand groupe, les tâches étaient réparties selon les préférences et les compétences de chacun. Cependant, ce projet m'a permis d'apprendre à utiliser JavaFX pour créer des applications.",
					"links":[]
				},
				{
					"title":"Exploitation d'une base de données pour produire des statistiques",
					"start":"2023",
					"end":"2023",
					"description":"Rédaction en cours ;)",
					"role":"",
					"bilan":"",
					"links":[]
				},
				{
					"title":"Installation d'un poste doté de services réseaux et d'une BDD",
					"start":"2023",
					"end":"2023",
					"description":"Ce projet consistait à mettre en place un poste de travail sous Linux contenant une base de données totalement fonctionnelle et des services réseaux permettant d'y accéder.",
					"role":"Ce projet étant un projet en solo, l'installation de ce poste a entièrement été faite par moi.",
					"bilan":"Ce projet était similaire à l'installation du premier semestre, avec des étapes en plus.",
					"links":[]
				}
			]
		},
		{
			"name": "BUT semestre 3",
			"list": [
				{
					"title":"Game Jam en Python",
					"start":"2023",
					"end":"22023",
					"description":"Cette Game Jam était réalisée en groupes et nous devions créer en une semaine un jeu sur un thème choisi par le corps enseignant.",
					"role":"Étant dans un petit groupe, nous avons tous participé à tout, nous permettant d'avoir plusieurs solutions à un problème et de voir plus facilement les erreurs tout en ayant participé à tous les aspects du jeu.",
					"bilan":"Cette Game Jam m'a permis de programmer à nouveau en Python pour une semaine. Cependant, Pygame n'est pas simple à comprendre même après cet exercice.",
					"links":[]
				},
				{
					"title":"Création d'un Serious Game éducatif",
					"start":"2023",
					"end":"2024",
					"description":"En groupes assez larges, nous devions choisir une matière pour laquelle nous devions créer un jeu éducatif permettant à de potentiels élèves d'apprendre en s'amusant.",
					"role":"Notre jeu étant divisé en une partie jeux et une partie web pour voir l'évolution des élèves, j'ai participé principalement à la partie web contenant un lien de téléchargement et une visualisation de ses statistiques en plus de celles de ses élèves.",
					"bilan":"Ce projet était un défi, car le sujet n'était pas très clair au début.",
					"links":[]
				}
			]
		},
		{
			"name": "BUT semestre 4",
			"list": [
				{
					"title":"Mini projet: Développement d'une application simple en Android",
					"start":"2024",
					"end":"2024",
					"description":"Ce projet avait pour objectif de nous apprendre les bases des applications Android. Nous devions créer une application contenant de simples exercices comme des multiplications ou des questions, mais aussi une gestion locale de comptes pour séparer les résultats des différents utilisateurs.",
					"role":"Étant un projet solo, l'application entière était réalisée par la même personne.",
					"bilan":"Cet exercice était très efficace pour nous apprendre les bases et m'a donné envie d'approfondir mes connaissances.",
					"links":[]
				},
				{
					"title":"Mini projet: Développement d'un site web d'achat en ligne avec Symfony",
					"start":"2024",
					"end":"2024",
					"description":"Ce projet avait pour objectif de nous apprendre les bases des sites web créés avec Symfony. Il s'agissait de créer un site fictif d'achat en ligne utilisant les différentes fonctions de Symphony.",
					"role":"Étant un projet solo, le site a été réalisé par la même personne.",
					"bilan":"J'ai trouvé cet exercice complexe, car ma compréhension de Symfony n'était pas super.",
					"links":[]
				},
				{
					"title":"Mini projet: Développement d'une application web JavaScript appelant une API publique",
					"start":"2024",
					"end":"2024",
					"description":"Dans le but de nous apprendre le JavaScript, nous devions, en binôme, créer un petit site permettant d'appeler une API publique et de visualiser les informations renvoyées.",
					"role":"Étant un projet en binôme, nous avons participé à toutes les parties du projet.",
					"bilan":"Ce projet était court, mais intéressant pour la compréhension de JavaScript et des API.",
					"links":[]
				}
			]
		}
		
	],
	"parcours": [
		{
			"name": "Mes objectifs",
			"list": [
				{
					"texts": [
						{
							"text": "BUT Informatique - IUT2 Grenoble, 2 place Doyen GosseJ'aimerais dans l'avenir me tourner dans le développement web mais je ne suis absolument pas un designeur pour autant. (Comme vous l'avez surement remarqué en regardant ce portfolio)"	
						}
					]
				}
			]
		},
		{
			"name": "BUT Informatique - IUT2 Grenoble, 2 place Doyen Gosse",
			"list": [
				{
					"start" : "2022",
					"end": "Maintenant",
					"texts": [
						{
							"text": "Parcours A: Développement d'applications"	
						}
					]
				}
			]
		},
		{
			"name": "Lycée Général - Bourgoin-Jallieu / La Côte Saint André",
			"list": [
				{
					"start" : "2020",
					"end": "2022",
					"texts": [
						{
							"text": "Terminale générale: options SI, NSI, Maths"	
						},
						{
							"text": "Première générale: options NSI, Maths"	
						}
					]
				},
				{
					"start" : "2019",
					"end": "2020",
					"texts": [
						{
							"text": "Seconde générale: option SI et LV3 Italien"	
						}
					]
				}
			]
		}
	]
}








